[
    "The Indian Constitution is one of the world’s longest, with 470 Articles spread over 25 parts and 12 schedules, showcasing the vastness of India's legal framework.",
    "India's Constitution borrows elements from countries like the U.S. (Fundamental Rights), Britain (Parliamentary System), and Ireland (Directive Principles of State Policy).",
    "The original Constitution was handwritten in English and Hindi, taking over six months by calligrapher Prem Behari Narain Raizada.",
    "With over 900 million eligible voters, India is the world’s largest democracy, governed by the guiding principles of its Constitution.",
    "The Indian Judiciary is independent of the executive and legislature, ensuring that judges can make unbiased, fair decisions without political pressure.",
    "The Directive Principles in Part IV guide the state for social welfare but cannot be enforced by any court.",
    "The Constitution grants special rights to citizens, such as equality, freedom of speech, and cultural rights, but non-citizens can also enjoy basic rights like protection of life and liberty.",
    "The Preamble was changed only once, in 1976, adding the terms 'socialist,' 'secular,' and 'integrity.'",
    "The Supreme Court can take cases on its own under 'suo moto' actions, which enables it to address matters of national importance without a formal petition.",
    "The President of India holds the power to grant pardons, reprieves, or commutations in cases involving severe punishments.",
    "Fundamental Duties were added in 1976 via the 42nd Amendment to encourage citizens to respect and protect the nation’s heritage and unity.",
    "India celebrates Constitution Day on November 26 to honor the adoption of the Constitution in 1949.",
    "India’s judiciary is a single system across the country, with the Supreme Court at the top, followed by High Courts and lower courts.",
    "India’s Constitution does not declare a national language; instead, it designates Hindi and English as official languages.",
    "Amending the Constitution requires a rigorous process with different levels of majority, reflecting both flexibility and stability.",
    "In certain circumstances, like emergency, fundamental rights can be suspended, except for the rights to life and personal liberty.",
    "Judges of the Supreme Court retire at 65, while High Court judges retire at 62, ensuring timely turnover in the judiciary.",
    "The Constitution allows the President to declare National, State, and Financial Emergencies, centralizing power during crises.",
    "The very first amendment in 1951 addressed land reform laws, illustrating the Constitution’s responsiveness to socio-economic challenges.",
    "Article 39A of the Constitution mandates free legal aid, ensuring that justice is accessible to the poor and underprivileged, strengthening India’s commitment to equal justice.",
    "The Indian Constitution is the supreme law, meaning all other laws must align with it; if a law conflicts, it can be struck down.",
    "The Supreme Court and High Courts have the power of judicial review, enabling them to invalidate laws that violate the Constitution.",
    "The Lok Sabha (House of the People) has a term of five years but can be dissolved earlier by the President or extended during a national emergency.",
    "The Right to Education was made a fundamental right in 2009 under Article 21A, ensuring free and compulsory education for children aged 6-14.",
    "Certain states like Jammu & Kashmir (until 2019), Nagaland, and Mizoram have special provisions to safeguard cultural and ethnic practices.",
    "The 42nd Amendment in 1976 is known as the 'Mini-Constitution' because it made sweeping changes, enhancing the power of the central government.",
    "The Constitution divides powers into Union, State, and Concurrent lists, with Union handling defense, State managing police, and both working on education.",
    "India is a secular country, meaning the state treats all religions equally without favoring or promoting any particular faith.",
    "The Supreme Court handles disputes between states, ensuring a fair resolution in matters like water sharing or boundary conflicts.",
    "The Constitution provides reservations for Scheduled Castes, Scheduled Tribes, and other backward classes to promote social equality.",
    "India has had three national emergencies—two during wars (1962, 1971) and one internal emergency in 1975.",
    "The 52nd Amendment (1985) introduced the anti-defection law, preventing elected members from switching parties without consequences.",
    "Article 32 gives citizens the right to approach the Supreme Court directly if their fundamental rights are violated, often called the 'heart and soul of the Constitution.'",
    "India follows the principle of single citizenship, unlike countries like the U.S. where individuals hold both state and national citizenship.",
    "The Attorney General is the highest law officer in India, representing the government in legal matters before the Supreme Court.",
    "Most constitutional amendments do not require state ratification unless they affect state powers or representation.",
    "Fundamental Rights are enforceable in court, but Fundamental Duties, although crucial, are not legally enforceable.",
    "Through the 36th Amendment in 1975, Sikkim became a full state of India with special protections for its people’s rights.",
    "The Supreme Court declared the Right to Privacy as a fundamental right in 2017 under Article 21 (Protection of Life and Personal Liberty).",
    "The Supreme Court has original jurisdiction over cases involving the Union and state governments, providing a neutral ground for intergovernmental issues."
  ]
  